## User Testing
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |               RESOURCE               |
|--------|--------------------------------------|
| add    | `aws_alb_listener_rule.security_txt` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_alb_listener_rule.security_txt will be created
  + resource "aws_alb_listener_rule" "security_txt" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:ca-central-1:975050085632:listener/app/valentine/e31ad117f42a62b9/895b64d89d92b678"
      + priority     = 1
      + region       = "ca-central-1"
      + tags         = {
          + "CostCentre" = "valentine-user-testing"
        }
      + tags_all     = {
          + "CostCentre" = "valentine-user-testing"
        }

      + action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = <<-EOT
                    Contact: mailto:ZZTBSCYBERS@tbs-sct.gc.ca
                    Contact: https://hackerone.com/tbs-sct/
                    Canonical: https://cdssandbox.xyz/.well-known/security.txt
                    Expires: 2026-03-02T12:00:00.000Z
                    Preferred-Languages: en, fr
                EOT
              + status_code  = "200"
            }
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/.well-known/security.txt",
                ]
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/rds_cluster/rds/locals.tf line 14, in locals:
  14:   region        = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

